{
    "partial_orders": [
        {
            "src": 1,
            "tgt": 0,
            "reason": "This is a cut-and-paste move operation where the same line 'client = F5RestClient(**module.params)' is being moved from inside the try block (line 524) to outside the try block (line 523). Edit 1 removes the line from its original location, and Edit 0 adds it to the new location. For this to work correctly, the removal must happen before the addition to avoid having duplicate lines. This creates a parser-level dependency where Edit 1 must occur before Edit 0."
        },
        {
            "src": 4,
            "tgt": 5,
            "reason": "Both edits perform identical structural changes to the same file: removing F5ModuleError and iControlUnexpectedHTTPError imports, and adding unittest, Mock, and patch imports with the same comment about Ansible 2.8. The changes follow the same before→after pattern and target the same type of syntactic construct (import statements). This represents a uniform refactoring operation being applied to two different import blocks within the same file, making either edit a natural prompt for the other as part of the same contiguous micro-task."
        },
        {
            "src": 5,
            "tgt": 4,
            "reason": "Both edits perform identical structural changes to the same file: removing F5ModuleError and iControlUnexpectedHTTPError imports, and adding unittest, Mock, and patch imports with the same comment about Ansible 2.8. The changes follow the same before→after pattern and target the same type of syntactic construct (import statements). This represents a uniform refactoring operation being applied to two different import blocks within the same file, making either edit a natural prompt for the other as part of the same contiguous micro-task."
        },
        {
            "src": 3,
            "tgt": 5,
            "reason": "These edits involve moving the same three import statements (unittest, Mock, patch) from the top-level imports (lines 17-19) to inside a try-except block (lines 38-40). This is a cut-and-paste move operation where the imports are first removed from their original location and then added to a new location. The removal must occur before the relocation to avoid duplicate imports, making this an ordered relationship where edit 0 (removal) must happen before edit 1 (addition)."
        },
        {
            "src": 3,
            "tgt": 4,
            "reason": "These edits are performing a bulk refactoring operation where import statements are being moved from the top-level imports to inside a try-except block. Edit 0 removes the unittest and mock imports from lines 17-19, while Edit 1 adds these same imports (with updated paths) inside the try block at lines 25-27. This is a coordinated move operation where the imports are being relocated as part of restructuring the import organization. The exact same symbols (unittest, Mock, patch) are being removed from one location and added to another location with updated paths. This represents a cut-and-paste style refactoring where the removal must logically occur before the relocation to avoid duplication."
        }
    ],
    "allowed_init_edits": [
        1,
        3,
        2
    ]
}