{
    "partial_orders": [
        {
            "src": 1,
            "tgt": 0,
            "reason": "Edit 0 adds a ZabbixAPIExtends class definition at lines 174-179, while Edit 1 removes the exact same ZabbixAPIExtends class definition from lines 175-184. This is a classic cut-and-paste move operation where the same code block is being relocated from one position to another within the file. The removal must occur before the insertion to avoid having duplicate class definitions, which would cause a syntax error in Python. The changed lines reference the exact same symbol (ZabbixAPIExtends class) and this represents a single atomic operation of moving code."
        },
        {
            "src": 0,
            "tgt": 5,
            "reason": "Both edits involve identical structural changes to the same class definition pattern - they both modify the indentation of a ZabbixAPIExtends class definition and its attributes from 4 spaces to 8 spaces. This appears to be part of a uniform code formatting/indentation fix across multiple files. The changes follow the exact same before→after pattern (4-space indentation → 8-space indentation) and target the same type of syntactic construct (class definition blocks). This represents a bulk formatting operation that would naturally be performed as part of a single, contiguous refactoring task."
        },
        {
            "src": 5,
            "tgt": 0,
            "reason": "Both edits involve identical structural changes to the same class definition pattern - they both modify the indentation of a ZabbixAPIExtends class definition and its attributes from 4 spaces to 8 spaces. This appears to be part of a uniform code formatting/indentation fix across multiple files. The changes follow the exact same before→after pattern (4-space indentation → 8-space indentation) and target the same type of syntactic construct (class definition blocks). This represents a bulk formatting operation that would naturally be performed as part of a single, contiguous refactoring task."
        },
        {
            "src": 3,
            "tgt": 2,
            "reason": "This is a cut-and-paste move operation where the exact same code block (ZabbixAPIExtends class definition) is being removed from one location (lines 114-119) and added to another location (lines 109-114) within the same file. The removal must occur before the addition to avoid having duplicate class definitions, which would cause a syntax/parser error. This creates an ordered dependency where edit 1 (removal) must happen before edit 0 (addition)."
        },
        {
            "src": 4,
            "tgt": 7,
            "reason": "This is a cut-and-paste move operation where the exact same code block (HAS_ZABBIX_API = True and the except ImportError block) is being removed from one location (lines 149-151) and added to another location (lines 160-162). The removal must occur before the addition to avoid code duplication, making this an ordered relationship where edit 0 (removal) must happen before edit 1 (addition)."
        },
        {
            "src": 5,
            "tgt": 6,
            "reason": "Both edits are performing identical indentation changes to the same code block. Edit 0 changes the indentation of the class definition and its comment from 4 spaces to 8 spaces, while Edit 1 changes the indentation of the __init__ method definition from 8 spaces to 12 spaces. These are part of a single, contiguous indentation refactoring operation where the entire class block is being re-indented consistently. The changes are structurally synchronized - both are applying the same indentation pattern (adding 4 spaces) to maintain proper Python syntax hierarchy. Either edit can be applied first since both are valid Python syntax independently, and after making either edit, the other becomes the immediate next step to complete the uniform indentation refactoring."
        },
        {
            "src": 6,
            "tgt": 5,
            "reason": "Both edits are performing identical indentation changes to the same code block. Edit 0 changes the indentation of the class definition and its comment from 4 spaces to 8 spaces, while Edit 1 changes the indentation of the __init__ method definition from 8 spaces to 12 spaces. These are part of a single, contiguous indentation refactoring operation where the entire class block is being re-indented consistently. The changes are structurally synchronized - both are applying the same indentation pattern (adding 4 spaces) to maintain proper Python syntax hierarchy. Either edit can be applied first since both are valid Python syntax independently, and after making either edit, the other becomes the immediate next step to complete the uniform indentation refactoring."
        }
    ],
    "allowed_init_edits": [
        1,
        3,
        4
    ]
}